In [30]:
import numpy as np
import pandas as pd

In [18]:
N = 10

**Задание 1**
​
Создайте numpy array с элементами от числа N до 0 (например, для N = 10 это будет array([9, 8, 7, 6, 5, 4, 3, 2, 1, 0])).
​
*

In [24]:
ar = np.arange(N-1,0-1,-1)
ar

array([9, 8, 7, 6, 5, 4, 3, 2, 1, 0])

**Задание 2**
Создайте диагональную матрицу с элементами от N до 0. Посчитайте сумму ее значений на диагонали.

In [29]:
diag_m = np.diag(ar)
diag_m.diagonal().sum()

45

**Задание 3**
​
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.
​

In [42]:
ratings_ds = pd.read_csv('ml-latest-small/ratings.csv')
ratings_ds.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [56]:
movie_ds = pd.read_csv('ml-latest-small/movies.csv')
movie_ds.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [53]:
movieId_max = ratings_ds[ratings_ds['rating']==5].groupby('movieId').count()['rating'].argmax()

In [57]:
movie_ds[movie_ds['movieId']==movieId_max]

     movieId                             title       genres
277      318  Shawshank Redemption, The (1994)  Crime|Drama

**Задание 4**
​
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.
​

In [61]:
power_ds = pd.read_csv('power.csv')
power_ds.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [78]:
power_ds[(power_ds['country'].isin(['Latvia','Lithuania','Estonia']))
        &(power_ds['category'].isin([4,12,21]))
        &(power_ds['quantity']>=0)]['quantity'].sum()

970728.0

#### **Задание 5**
​
Решите систему уравнений:
* 4x + 2y + z = 4
* x + 3y = 12
* 5y + 4z = -3
​

In [80]:
A = np.array([[4,2,1],
              [1,3,0],
              [0,5,4]])
B = np.array([[4],[12],[-3]])

In [90]:
X = np.linalg.solve(A,B)
X

array([[ 0.46666667],
       [ 3.84444444],
       [-5.55555556]])

In [109]:
Y = A.dot(X)
all(B-Y<1e-10)

True